百胜传统.org
* 传统一些功能
** 今日摘要外的标签
*** 原有功能
1. ------栏目--------
2. 列出所有标签下的栏目--每个标签下的栏目怎么来的？
3. 根据=选取的新闻=和=选取的今日摘要下的栏目=，进行推送
4. 选取新闻，批量删除
5. 选取新闻，合并，合并到最上面一条，序号最小的，最重要的--合并后只展示合并到的那一条？
6. 选取新闻，批量修改
7. 在当前栏目下添加一条新闻
8. 删除一个栏目
9. -------对每个栏目下的新闻---------
10. 单条新闻，保存修改
11. 批量添加相似站点--怎么判断是相似站点？
12. 删除相似站点
*** 新增功能
1. 当前栏目内的新闻，实现点击按钮上下移动
2. 当前栏目内的新闻，实现拖动移动 -_-!
3. 每条新闻进行打标  
4. 回收站，删除的新闻到相应栏目的回收站中
** 今日摘要
*** 原有功能
 比其他标签少了推送、合并
*** 新增功能
 比其他标签的新增功能一样
* 新系统
** 过滤页面
1. 右侧树展示所有栏目，读取配置的ckm模板
2. 由标签页和右侧栏目树，查询打过标的新闻
3. 对每条新闻进行修改、添加相似站点操作
   - 原型中有合并，合并的依据是什么？
   - 相似站点查询依据
4. 推送到排版页面，同时生成每页页面下的栏目标签
5. 添加一条新闻
6. 输入验证
** 排版页面
*** 都有的功能
1. 导出相关品牌下的日报功能。
2. 上下移动排序
*** 除今日摘要外其他标签
1. 单条和批量推送到今日摘要的相应栏目下，原型里有对应关系，并且当前栏目下本条信息仍然保留
2. 撤回到过滤页面回收站
   - 如果是推送到今日摘要的需不需要同时删除？
*** 今日摘要
1. 单条删除
   - 仅删除今日摘要里的这一条，其他标签的不动。
** 其他功能
1. 排序由点击按钮上下移动，改为拖动对应div移动
2. 。。。

* 关于原型设计文档
** 1.1
*** 检索框
1. 微博是直接从server库查询，有查询出的结果直接标红，
   如果需要放到mysql中，这个功能看下如何实现。。
*** 文章内容
1. 发布时间为什么需要手写？
   一定要手写的话需要验证输入的时间格式
2. +点击跳转到原始链接？之前系统时删除功能，还需不需要？+
   已经修改，仍然是点击时弹窗确认是否删除。
3. 批量添加 
   需要验证输入内容的格式
*** 信息分类
1. 下拉框规则不全是可以新建，并添加到分类规则里？
   意思是可以手动输入？这样分类规则会有很多。
2. 分类规则里没有关键词的分类不进行检索？
*** 操作
1. 合并可以放在排版页面吧？
2. 推送，站点和问题分类只会有一个？还是多个？
   现在每个标签下是既有产品又有问题分类，
   是不是一条新闻既会出现在一个标签下的产品里，也会出现在同一个标签下的问题分类里
*** 右侧检索树
1. 这个树现在是把产品和其他的东西混在一起的，是都当做产品了？
   如果是分为两类，是不是需要写两个检索树？打标会打到一个字段还是两个字段？
*** 其他
1. 确定下最右边站点名称和问题分类都怎么写的
** 1.2
*** 回收站按时间排序
需要在所有的删除操作，包括过滤页面和排版页面的，记录一个修改时间，lasttime
** 2.1 除今日摘要外的其他标签
主题是指网络新闻、平面媒体、BBS/BLOG,电视视频？
*** 推送过来的数据按品牌名称聚类
1. 每条数据的产品分类时一个还是多个
   和之前的推送问题一样。
*** 撤回和批量删除
1. 如果已经推送到今日摘要中的数据，是否一起放到回收站中？
*** 批量推送
1. 人工选择？
   不是有一个对应关系吗？如果可以确定的话，程序可以根据对应关系直接推送
   今日摘要里有写这个对应关系。
** 2.2 今日摘要
  暂无
* 123
1. 之前微博的系统连接了三个库，直接更新和查询，容易出现超时等情况，导致更新状态等操作失败，因此传统的考虑借鉴旧系统的做法，做一个定时任务，
   在做日报之前首先将当天数据入到mysql一个库中，之后就只操作mysql了，这样需要考虑在mysql中如何保存每天的日报信息，有两种方法:
   1. 考虑将mysql中日报信息信息的状态更新到本来的库中，这样做日报，季报等可以查原来的库。
   2. 在mysql中，另外新建一些表，存储每天的日报信息，完全跟本来的库隔离开了

   另外确认下新闻的信是时怎么采集到的，如果和微博一样，有部分是需要每天提交采集的话，就需要提供手动调接口导数据的功能了。
   如果提供手动调接口的功能，可以看下只导入提交采集的就可以了。。快一点。

2. 数据库表看下能不能借鉴下之前的。。

3. 现在融合之后有两个页面，考虑登陆之后怎么跳转到微博或者传统

4. 除了检索页面每次操作之后重新加载，其他页面的删除，更新操作都做成操作dom的，不刷新页面

5. 排版中心异步加载每个栏目下的数据，借鉴微博的效果

6. 。。。
