百胜传统.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-22 周三 10:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline7">1. 传统一些功能</a>
<ul>
<li><a href="#orgheadline3">1.1. 今日摘要外的标签</a>
<ul>
<li><a href="#orgheadline1">1.1.1. 原有功能</a></li>
<li><a href="#orgheadline2">1.1.2. 新增功能</a></li>
</ul>
</li>
<li><a href="#orgheadline6">1.2. 今日摘要</a>
<ul>
<li><a href="#orgheadline4">1.2.1. 原有功能</a></li>
<li><a href="#orgheadline5">1.2.2. 新增功能</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline14">2. 新系统</a>
<ul>
<li><a href="#orgheadline8">2.1. 过滤页面</a></li>
<li><a href="#orgheadline12">2.2. 排版页面</a>
<ul>
<li><a href="#orgheadline9">2.2.1. 都有的功能</a></li>
<li><a href="#orgheadline10">2.2.2. 除今日摘要外其他标签</a></li>
<li><a href="#orgheadline11">2.2.3. 今日摘要</a></li>
</ul>
</li>
<li><a href="#orgheadline13">2.3. 其他功能</a></li>
</ul>
</li>
<li><a href="#orgheadline29">3. 关于原型设计文档</a>
<ul>
<li><a href="#orgheadline21">3.1. 1.1</a>
<ul>
<li><a href="#orgheadline15">3.1.1. 检索框</a></li>
<li><a href="#orgheadline16">3.1.2. 文章内容</a></li>
<li><a href="#orgheadline17">3.1.3. 信息分类</a></li>
<li><a href="#orgheadline18">3.1.4. 操作</a></li>
<li><a href="#orgheadline19">3.1.5. 右侧检索树</a></li>
<li><a href="#orgheadline20">3.1.6. 其他</a></li>
</ul>
</li>
<li><a href="#orgheadline23">3.2. 1.2</a>
<ul>
<li><a href="#orgheadline22">3.2.1. 回收站按时间排序</a></li>
</ul>
</li>
<li><a href="#orgheadline27">3.3. 2.1 除今日摘要外的其他标签</a>
<ul>
<li><a href="#orgheadline24">3.3.1. 推送过来的数据按品牌名称聚类</a></li>
<li><a href="#orgheadline25">3.3.2. 撤回和批量删除</a></li>
<li><a href="#orgheadline26">3.3.3. 批量推送</a></li>
</ul>
</li>
<li><a href="#orgheadline28">3.4. 2.2 今日摘要</a></li>
</ul>
</li>
<li><a href="#orgheadline30">4. 123</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> 传统一些功能</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.1</span> 今日摘要外的标签</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> 原有功能</h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>&#x2014;&#x2014;栏目&#x2013;&#x2014;&#x2014;</li>
<li>列出所有标签下的栏目&#x2013;每个标签下的栏目怎么来的？</li>
<li>根据=选取的新闻=和=选取的今日摘要下的栏目=，进行推送</li>
<li>选取新闻，批量删除</li>
<li>选取新闻，合并，合并到最上面一条，序号最小的，最重要的&#x2013;合并后只展示合并到的那一条？</li>
<li>选取新闻，批量修改</li>
<li>在当前栏目下添加一条新闻</li>
<li>删除一个栏目</li>
<li>-&#x2014;&#x2014;对每个栏目下的新闻&#x2014;&#x2014;&#x2014;</li>
<li>单条新闻，保存修改</li>
<li>批量添加相似站点&#x2013;怎么判断是相似站点？</li>
<li>删除相似站点</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> 新增功能</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>当前栏目内的新闻，实现点击按钮上下移动</li>
<li>当前栏目内的新闻，实现拖动移动 -_-!</li>
<li>每条新闻进行打标</li>
<li>回收站，删除的新闻到相应栏目的回收站中</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.2</span> 今日摘要</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.2.1</span> 原有功能</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
比其他标签少了推送、合并
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.2.2</span> 新增功能</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
比其他标签的新增功能一样
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">2</span> 新系统</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.1</span> 过滤页面</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>右侧树展示所有栏目，读取配置的ckm模板</li>
<li>由标签页和右侧栏目树，查询打过标的新闻</li>
<li>对每条新闻进行修改、添加相似站点操作
<ul class="org-ul">
<li>原型中有合并，合并的依据是什么？</li>
<li>相似站点查询依据</li>
</ul></li>
<li>推送到排版页面，同时生成每页页面下的栏目标签</li>
<li>添加一条新闻</li>
<li>输入验证</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.2</span> 排版页面</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">2.2.1</span> 都有的功能</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>导出相关品牌下的日报功能。</li>
<li>上下移动排序</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">2.2.2</span> 除今日摘要外其他标签</h4>
<div class="outline-text-4" id="text-2-2-2">
<ol class="org-ol">
<li>单条和批量推送到今日摘要的相应栏目下，原型里有对应关系，并且当前栏目下本条信息仍然保留</li>
<li>撤回到过滤页面回收站
<ul class="org-ul">
<li>如果是推送到今日摘要的需不需要同时删除？</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">2.2.3</span> 今日摘要</h4>
<div class="outline-text-4" id="text-2-2-3">
<ol class="org-ol">
<li>单条删除
<ul class="org-ul">
<li>仅删除今日摘要里的这一条，其他标签的不动。</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.3</span> 其他功能</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>排序由点击按钮上下移动，改为拖动对应div移动</li>
<li>。。。</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">3</span> 关于原型设计文档</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">3.1</span> 1.1</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">3.1.1</span> 检索框</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>微博是直接从server库查询，有查询出的结果直接标红，
如果需要放到mysql中，这个功能看下如何实现。。</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">3.1.2</span> 文章内容</h4>
<div class="outline-text-4" id="text-3-1-2">
<ol class="org-ol">
<li>发布时间为什么需要手写？
一定要手写的话需要验证输入的时间格式</li>
<li><del>点击跳转到原始链接？之前系统时删除功能，还需不需要？</del>
   已经修改，仍然是点击时弹窗确认是否删除。</li>
<li>批量添加 
需要验证输入内容的格式</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">3.1.3</span> 信息分类</h4>
<div class="outline-text-4" id="text-3-1-3">
<ol class="org-ol">
<li>下拉框规则不全是可以新建，并添加到分类规则里？
意思是可以手动输入？这样分类规则会有很多。</li>
<li>分类规则里没有关键词的分类不进行检索？</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">3.1.4</span> 操作</h4>
<div class="outline-text-4" id="text-3-1-4">
<ol class="org-ol">
<li>合并可以放在排版页面吧？</li>
<li>推送，站点和问题分类只会有一个？还是多个？
现在每个标签下是既有产品又有问题分类，
是不是一条新闻既会出现在一个标签下的产品里，也会出现在同一个标签下的问题分类里</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">3.1.5</span> 右侧检索树</h4>
<div class="outline-text-4" id="text-3-1-5">
<ol class="org-ol">
<li>这个树现在是把产品和其他的东西混在一起的，是都当做产品了？
如果是分为两类，是不是需要写两个检索树？打标会打到一个字段还是两个字段？</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">3.1.6</span> 其他</h4>
<div class="outline-text-4" id="text-3-1-6">
<ol class="org-ol">
<li>确定下最右边站点名称和问题分类都怎么写的</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.2</span> 1.2</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.2.1</span> 回收站按时间排序</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
需要在所有的删除操作，包括过滤页面和排版页面的，记录一个修改时间，lasttime
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">3.3</span> 2.1 除今日摘要外的其他标签</h3>
<div class="outline-text-3" id="text-3-3">
<p>
主题是指网络新闻、平面媒体、BBS/BLOG,电视视频？
</p>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.3.1</span> 推送过来的数据按品牌名称聚类</h4>
<div class="outline-text-4" id="text-3-3-1">
<ol class="org-ol">
<li>每条数据的产品分类时一个还是多个
和之前的推送问题一样。</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">3.3.2</span> 撤回和批量删除</h4>
<div class="outline-text-4" id="text-3-3-2">
<ol class="org-ol">
<li>如果已经推送到今日摘要中的数据，是否一起放到回收站中？</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.3.3</span> 批量推送</h4>
<div class="outline-text-4" id="text-3-3-3">
<ol class="org-ol">
<li>人工选择？
不是有一个对应关系吗？如果可以确定的话，程序可以根据对应关系直接推送
今日摘要里有写这个对应关系。</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">3.4</span> 2.2 今日摘要</h3>
<div class="outline-text-3" id="text-3-4">
<p>
暂无
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">4</span> 123</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><p>
之前微博的系统连接了三个库，直接更新和查询，容易出现超时等情况，导致更新状态等操作失败，因此传统的考虑借鉴旧系统的做法，做一个定时任务，
在做日报之前首先将当天数据入到mysql一个库中，之后就只操作mysql了，这样需要考虑在mysql中如何保存每天的日报信息，有两种方法:
</p>
<ol class="org-ol">
<li>考虑将mysql中日报信息信息的状态更新到本来的库中，这样做日报，季报等可以查原来的库。</li>
<li>在mysql中，另外新建一些表，存储每天的日报信息，完全跟本来的库隔离开了</li>
</ol>
<p>
另外确认下新闻的信是时怎么采集到的，如果和微博一样，有部分是需要每天提交采集的话，就需要提供手动调接口导数据的功能了。
如果提供手动调接口的功能，可以看下只导入提交采集的就可以了。。快一点。
</p></li>

<li>数据库表看下能不能借鉴下之前的。。</li>

<li>现在融合之后有两个页面，考虑登陆之后怎么跳转到微博或者传统</li>

<li>除了检索页面每次操作之后重新加载，其他页面的删除，更新操作都做成操作dom的，不刷新页面</li>

<li>排版中心异步加载每个栏目下的数据，借鉴微博的效果</li>

<li>。。。</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-06-22 周三 10:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
